Revit 2027 API
BuiltInFailures.GeometryFailures.FailedReplaceCurveElemCurveDriver Property
 Failed to replace curve elem curve driver.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FailedReplaceCurveElemCurveDriver { get; }
Public Shared ReadOnly Property FailedReplaceCurveElemCurveDriver As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FailedReplaceCurveElemCurveDriver {
	FailureDefinitionId^ get ();
}
static member FailedReplaceCurveElemCurveDriver : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeometryFailures Class
Autodesk.Revit.DB Namespace